void main() {
  //TODO (logical operators)
  //! العمليات المنطقية
  int a = 1, b = 2, c = 3;
  print(!(a > b)); //عكس الشرط - لو الشرط صح هيرجع بفولس
  print(a > b && b < c); //لازم يكون الشرطين صح - و
  print(a > b || b < c); //لو الشرطين صح او واحد بس صح - او

  //*العمليات المقارنة (مثل ==, !=, >, <) تُستخدم لمقارنة القيم.
//*العمليات المنطقية (مثل &&, ||, !) تُستخدم للدمج بين القيم البوليانية أو تعديلها.
  //? العمليات المنطقية تُستخدم بشكل شائع في الشروط، الحلقات، والتعبيرات الشرطية.
  //? العمليات المنطقية تُستخدم لتحديد ما إذا كانت الشروط صحيحة أم لا.
  //? العمليات المنطقية تُستخدم في البرمجة للتحكم في تدفق البرنامج بناءً على الشروط المختلفة.
  //? العمليات المنطقية تُستخدم في البرمجة لإنشاء تعبيرات شرطية معقدة.


}
